ClearDotX/TRK-KEA8_128/LINStack/Examples/S12Z_examples/Lumen_S12ZVHY64/S12ZVHY64_Master/Project_Headers/mc9s12zvhy64.h
/*** PTIAB - Port AB Input Register; 0x00000222 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PTIA - Port A Input Register; 0x00000222 ***/
    union {
      byte Byte;
      struct {
        byte PTIA0       :1;                                       /* Port A data input 0 */
        byte PTIA1       :1;                                       /* Port A data input 1 */
        byte PTIA2       :1;                                       /* Port A data input 2 */
        byte PTIA3       :1;                                       /* Port A data input 3 */
        byte PTIA4       :1;                                       /* Port A data input 4 */
        byte PTIA5       :1;                                       /* Port A data input 5 */
        byte PTIA6       :1;                                       /* Port A data input 6 */
        byte PTIA7       :1;                                       /* Port A data input 7 */
      } Bits;
    } PTIASTR;
    #define PTIA                        _PTIAB.Overlap_STR.PTIASTR.Byte
    #define PTIA_PTIA0                  _PTIAB.Overlap_STR.PTIASTR.Bits.PTIA0
    #define PTIA_PTIA1                  _PTIAB.Overlap_STR.PTIASTR.Bits.PTIA1
    #define PTIA_PTIA2                  _PTIAB.Overlap_STR.PTIASTR.Bits.PTIA2
    #define PTIA_PTIA3                  _PTIAB.Overlap_STR.PTIASTR.Bits.PTIA3
    #define PTIA_PTIA4                  _PTIAB.Overlap_STR.PTIASTR.Bits.PTIA4
    #define PTIA_PTIA5                  _PTIAB.Overlap_STR.PTIASTR.Bits.PTIA5
    #define PTIA_PTIA6                  _PTIAB.Overlap_STR.PTIASTR.Bits.PTIA6
    #define PTIA_PTIA7                  _PTIAB.Overlap_STR.PTIASTR.Bits.PTIA7
    
    #define PTIA_PTIA0_MASK             1U
    #define PTIA_PTIA1_MASK             2U
    #define PTIA_PTIA2_MASK             4U
    #define PTIA_PTIA3_MASK             8U
    #define PTIA_PTIA4_MASK             16U
    #define PTIA_PTIA5_MASK             32U
    #define PTIA_PTIA6_MASK             64U
    #define PTIA_PTIA7_MASK             128U
    

    /*** PTIB - Port B Input Register; 0x00000223 ***/
    union {
      byte Byte;
      struct {
        byte PTIB0       :1;                                       /* Port B data input 0 */
        byte PTIB1       :1;                                       /* Port B data input 1 */
        byte PTIB2       :1;                                       /* Port B data input 2 */
        byte PTIB3       :1;                                       /* Port B data input 3 */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
      } Bits;
      struct {
        byte grpPTIB :4;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } PTIBSTR;
    #define PTIB                        _PTIAB.Overlap_STR.PTIBSTR.Byte
    #define PTIB_PTIB0                  _PTIAB.Overlap_STR.PTIBSTR.Bits.PTIB0
    #define PTIB_PTIB1                  _PTIAB.Overlap_STR.PTIBSTR.Bits.PTIB1
    #define PTIB_PTIB2                  _PTIAB.Overlap_STR.PTIBSTR.Bits.PTIB2
    #define PTIB_PTIB3                  _PTIAB.Overlap_STR.PTIBSTR.Bits.PTIB3
    #define PTIB_PTIB                   _PTIAB.Overlap_STR.PTIBSTR.MergedBits.grpPTIB
    
    #define PTIB_PTIB0_MASK             1U
    #define PTIB_PTIB1_MASK             2U
    #define PTIB_PTIB2_MASK             4U
    #define PTIB_PTIB3_MASK             8U
    #define PTIB_PTIB_MASK              15U
    #define PTIB_PTIB_BITNUM            0U
    
  } Overlap_STR;

  struct {
    word PTIB0       :1;                                       /* Port AB data input 0 */
    word PTIB1       :1;                                       /* Port AB data input 1 */
    word PTIB2       :1;                                       /* Port AB data input 2 */
    word PTIB3       :1;                                       /* Port AB data input 3 */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word PTIA0       :1;                                       /* Port AB data input 0 */
    word PTIA1       :1;                                       /* Port AB data input 1 */
    word PTIA2       :1;                                       /* Port AB data input 2 */
    word PTIA3       :1;                                       /* Port AB data input 3 */
    word PTIA4       :1;                                       /* Port AB data input 4 */
    word PTIA5       :1;                                       /* Port AB data input 5 */
    word PTIA6       :1;                                       /* Port AB data input 6 */
    word PTIA7       :1;                                       /* Port AB data input 7 */
  } Bits;
  struct {
    word grpPTIB :4;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word grpPTIA :8;
  } MergedBits;
} PTIABSTR;
extern volatile PTIABSTR _PTIAB @0x00000222;
#define PTIAB                           _PTIAB.Word
#define PTIAB_PTIB0                     _PTIAB.Bits.PTIB0
#define PTIAB_PTIB1                     _PTIAB.Bits.PTIB1
#define PTIAB_PTIB2                     _PTIAB.Bits.PTIB2
#define PTIAB_PTIB3                     _PTIAB.Bits.PTIB3
#define PTIAB_PTIA0                     _PTIAB.Bits.PTIA0
#define PTIAB_PTIA1                     _PTIAB.Bits.PTIA1
#define PTIAB_PTIA2                     _PTIAB.Bits.PTIA2
#define PTIAB_PTIA3                     _PTIAB.Bits.PTIA3
#define PTIAB_PTIA4                     _PTIAB.Bits.PTIA4
#define PTIAB_PTIA5                     _PTIAB.Bits.PTIA5
#define PTIAB_PTIA6                     _PTIAB.Bits.PTIA6
#define PTIAB_PTIA7                     _PTIAB.Bits.PTIA7
#define PTIAB_PTIB                      _PTIAB.MergedBits.grpPTIB
#define PTIAB_PTIA                      _PTIAB.MergedBits.grpPTIA

#define PTIAB_PTIB0_MASK                1U
#define PTIAB_PTIB1_MASK                2U
#define PTIAB_PTIB2_MASK                4U
#define PTIAB_PTIB3_MASK                8U
#define PTIAB_PTIA0_MASK                256U
#define PTIAB_PTIA1_MASK                512U
#define PTIAB_PTIA2_MASK                1024U
#define PTIAB_PTIA3_MASK                2048U
#define PTIAB_PTIA4_MASK                4096U
#define PTIAB_PTIA5_MASK                8192U
#define PTIAB_PTIA6_MASK                16384U
#define PTIAB_PTIA7_MASK                32768U
#define PTIAB_PTIB_MASK                 15U
#define PTIAB_PTIB_BITNUM               0U
#define PTIAB_PTIA_MASK                 65280U
#define PTIAB_PTIA_BITNUM               8U


/*** DDRAB - Port AB Data Direction Register; 0x00000224 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** DDRA - Port A Data Direction Register; 0x00000224 ***/
    union {
      byte Byte;
      struct {
        byte DDRA0       :1;                                       /* Port A data direction select 0 */
        byte DDRA1       :1;                                       /* Port A data direction select 1 */
        byte DDRA2       :1;                                       /* Port A data direction select 2 */
        byte DDRA3       :1;                                       /* Port A data direction select 3 */
        byte DDRA4       :1;                                       /* Port A data direction select 4 */
        byte DDRA5       :1;                                       /* Port A data direction select 5 */
        byte DDRA6       :1;                                       /* Port A data direction select 6 */
        byte DDRA7       :1;                                       /* Port A data direction select 7 */
      } Bits;
    } DDRASTR;
    #define DDRA                        _DDRAB.Overlap_STR.DDRASTR.Byte
    #define DDRA_DDRA0                  _DDRAB.Overlap_STR.DDRASTR.Bits.DDRA0
    #define DDRA_DDRA1                  _DDRAB.Overlap_STR.DDRASTR.Bits.DDRA1
    #define DDRA_DDRA2                  _DDRAB.Overlap_STR.DDRASTR.Bits.DDRA2
    #define DDRA_DDRA3                  _DDRAB.Overlap_STR.DDRASTR.Bits.DDRA3
    #define DDRA_DDRA4                  _DDRAB.Overlap_STR.DDRASTR.Bits.DDRA4
    #define DDRA_DDRA5                  _DDRAB.Overlap_STR.DDRASTR.Bits.DDRA5
    #define DDRA_DDRA6                  _DDRAB.Overlap_STR.DDRASTR.Bits.DDRA6
    #define DDRA_DDRA7                  _DDRAB.Overlap_STR.DDRASTR.Bits.DDRA7
    
