ClearDotX/TRK-KEA8_128/LINStack/Examples/S12Z_examples/Lumen_S12ZVHY64/S12ZVHY64_Master/Project_Headers/mc9s12zvhy64.h
    #define DDRA_DDRA0_MASK             1U
    #define DDRA_DDRA1_MASK             2U
    #define DDRA_DDRA2_MASK             4U
    #define DDRA_DDRA3_MASK             8U
    #define DDRA_DDRA4_MASK             16U
    #define DDRA_DDRA5_MASK             32U
    #define DDRA_DDRA6_MASK             64U
    #define DDRA_DDRA7_MASK             128U
    

    /*** DDRB - Port B Data Direction Register; 0x00000225 ***/
    union {
      byte Byte;
      struct {
        byte DDRB0       :1;                                       /* Port B data direction select 0 */
        byte DDRB1       :1;                                       /* Port B data direction select 1 */
        byte DDRB2       :1;                                       /* Port B data direction select 2 */
        byte DDRB3       :1;                                       /* Port B data direction select 3 */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
      } Bits;
      struct {
        byte grpDDRB :4;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } DDRBSTR;
    #define DDRB                        _DDRAB.Overlap_STR.DDRBSTR.Byte
    #define DDRB_DDRB0                  _DDRAB.Overlap_STR.DDRBSTR.Bits.DDRB0
    #define DDRB_DDRB1                  _DDRAB.Overlap_STR.DDRBSTR.Bits.DDRB1
    #define DDRB_DDRB2                  _DDRAB.Overlap_STR.DDRBSTR.Bits.DDRB2
    #define DDRB_DDRB3                  _DDRAB.Overlap_STR.DDRBSTR.Bits.DDRB3
    #define DDRB_DDRB                   _DDRAB.Overlap_STR.DDRBSTR.MergedBits.grpDDRB
    
    #define DDRB_DDRB0_MASK             1U
    #define DDRB_DDRB1_MASK             2U
    #define DDRB_DDRB2_MASK             4U
    #define DDRB_DDRB3_MASK             8U
    #define DDRB_DDRB_MASK              15U
    #define DDRB_DDRB_BITNUM            0U
    
  } Overlap_STR;

  struct {
    word DDRB0       :1;                                       /* Port AB data direction select 0 */
    word DDRB1       :1;                                       /* Port AB data direction select 1 */
    word DDRB2       :1;                                       /* Port AB data direction select 2 */
    word DDRB3       :1;                                       /* Port AB data direction select 3 */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word DDRA0       :1;                                       /* Port AB data direction select 8 */
    word DDRA1       :1;                                       /* Port AB data direction select 9 */
    word DDRA2       :1;                                       /* Port AB data direction select 10 */
    word DDRA3       :1;                                       /* Port AB data direction select 11 */
    word DDRA4       :1;                                       /* Port AB data direction select 12 */
    word DDRA5       :1;                                       /* Port AB data direction select 13 */
    word DDRA6       :1;                                       /* Port AB data direction select 14 */
    word DDRA7       :1;                                       /* Port AB data direction select 15 */
  } Bits;
  struct {
    word grpDDRB :4;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word grpDDRA :8;
  } MergedBits;
} DDRABSTR;
extern volatile DDRABSTR _DDRAB @0x00000224;
#define DDRAB                           _DDRAB.Word
#define DDRAB_DDRB0                     _DDRAB.Bits.DDRB0
#define DDRAB_DDRB1                     _DDRAB.Bits.DDRB1
#define DDRAB_DDRB2                     _DDRAB.Bits.DDRB2
#define DDRAB_DDRB3                     _DDRAB.Bits.DDRB3
#define DDRAB_DDRA0                     _DDRAB.Bits.DDRA0
#define DDRAB_DDRA1                     _DDRAB.Bits.DDRA1
#define DDRAB_DDRA2                     _DDRAB.Bits.DDRA2
#define DDRAB_DDRA3                     _DDRAB.Bits.DDRA3
#define DDRAB_DDRA4                     _DDRAB.Bits.DDRA4
#define DDRAB_DDRA5                     _DDRAB.Bits.DDRA5
#define DDRAB_DDRA6                     _DDRAB.Bits.DDRA6
#define DDRAB_DDRA7                     _DDRAB.Bits.DDRA7
#define DDRAB_DDRB                      _DDRAB.MergedBits.grpDDRB
#define DDRAB_DDRA                      _DDRAB.MergedBits.grpDDRA

#define DDRAB_DDRB0_MASK                1U
#define DDRAB_DDRB1_MASK                2U
#define DDRAB_DDRB2_MASK                4U
#define DDRAB_DDRB3_MASK                8U
#define DDRAB_DDRA0_MASK                256U
#define DDRAB_DDRA1_MASK                512U
#define DDRAB_DDRA2_MASK                1024U
#define DDRAB_DDRA3_MASK                2048U
#define DDRAB_DDRA4_MASK                4096U
#define DDRAB_DDRA5_MASK                8192U
#define DDRAB_DDRA6_MASK                16384U
#define DDRAB_DDRA7_MASK                32768U
#define DDRAB_DDRB_MASK                 15U
#define DDRAB_DDRB_BITNUM               0U
#define DDRAB_DDRA_MASK                 65280U
#define DDRAB_DDRA_BITNUM               8U


/*** PERAB - Port AB Pull Up Enable Register; 0x00000226 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PERA - Port A Pull Device Enable Register; 0x00000226 ***/
    union {
      byte Byte;
      struct {
        byte PERA0       :1;                                       /* Port A pull device enable 0 */
        byte PERA1       :1;                                       /* Port A pull device enable 1 */
        byte PERA2       :1;                                       /* Port A pull device enable 2 */
        byte PERA3       :1;                                       /* Port A pull device enable 3 */
        byte PERA4       :1;                                       /* Port A pull device enable 4 */
        byte PERA5       :1;                                       /* Port A pull device enable 5 */
        byte PERA6       :1;                                       /* Port A pull device enable 6 */
        byte PERA7       :1;                                       /* Port A pull device enable 7 */
      } Bits;
    } PERASTR;
    #define PERA                        _PERAB.Overlap_STR.PERASTR.Byte
    #define PERA_PERA0                  _PERAB.Overlap_STR.PERASTR.Bits.PERA0
    #define PERA_PERA1                  _PERAB.Overlap_STR.PERASTR.Bits.PERA1
    #define PERA_PERA2                  _PERAB.Overlap_STR.PERASTR.Bits.PERA2
    #define PERA_PERA3                  _PERAB.Overlap_STR.PERASTR.Bits.PERA3
    #define PERA_PERA4                  _PERAB.Overlap_STR.PERASTR.Bits.PERA4
    #define PERA_PERA5                  _PERAB.Overlap_STR.PERASTR.Bits.PERA5
    #define PERA_PERA6                  _PERAB.Overlap_STR.PERASTR.Bits.PERA6
    #define PERA_PERA7                  _PERAB.Overlap_STR.PERASTR.Bits.PERA7
    
