ClearDotX/TRK-KEA8_128/LINStack/Examples/S12Z_examples/Lumen_S12ZVHY64/S12ZVHY64_Master/Project_Headers/mc9s12zvhy64.h
    #define PERA_PERA0_MASK             1U
    #define PERA_PERA1_MASK             2U
    #define PERA_PERA2_MASK             4U
    #define PERA_PERA3_MASK             8U
    #define PERA_PERA4_MASK             16U
    #define PERA_PERA5_MASK             32U
    #define PERA_PERA6_MASK             64U
    #define PERA_PERA7_MASK             128U
    

    /*** PERB - Port B Pull Device Enable Register; 0x00000227 ***/
    union {
      byte Byte;
      struct {
        byte PERB0       :1;                                       /* Port B pull device enable 0 */
        byte PERB1       :1;                                       /* Port B pull device enable 1 */
        byte PERB2       :1;                                       /* Port B pull device enable 2 */
        byte PERB3       :1;                                       /* Port B pull device enable 3 */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
      } Bits;
      struct {
        byte grpPERB :4;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } PERBSTR;
    #define PERB                        _PERAB.Overlap_STR.PERBSTR.Byte
    #define PERB_PERB0                  _PERAB.Overlap_STR.PERBSTR.Bits.PERB0
    #define PERB_PERB1                  _PERAB.Overlap_STR.PERBSTR.Bits.PERB1
    #define PERB_PERB2                  _PERAB.Overlap_STR.PERBSTR.Bits.PERB2
    #define PERB_PERB3                  _PERAB.Overlap_STR.PERBSTR.Bits.PERB3
    #define PERB_PERB                   _PERAB.Overlap_STR.PERBSTR.MergedBits.grpPERB
    
    #define PERB_PERB0_MASK             1U
    #define PERB_PERB1_MASK             2U
    #define PERB_PERB2_MASK             4U
    #define PERB_PERB3_MASK             8U
    #define PERB_PERB_MASK              15U
    #define PERB_PERB_BITNUM            0U
    
  } Overlap_STR;

  struct {
    word PERB0       :1;                                       /* Port AB pull device enable 0 */
    word PERB1       :1;                                       /* Port AB pull device enable 1 */
    word PERB2       :1;                                       /* Port AB pull device enable 2 */
    word PERB3       :1;                                       /* Port AB pull device enable 3 */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word PERA0       :1;                                       /* Port AB pull device enable 8 */
    word PERA1       :1;                                       /* Port AB pull device enable 9 */
    word PERA2       :1;                                       /* Port AB pull device enable 10 */
    word PERA3       :1;                                       /* Port AB pull device enable 11 */
    word PERA4       :1;                                       /* Port AB pull device enable 12 */
    word PERA5       :1;                                       /* Port AB pull device enable 13 */
    word PERA6       :1;                                       /* Port AB pull device enable 14 */
    word PERA7       :1;                                       /* Port AB pull device enable 15 */
  } Bits;
  struct {
    word grpPERB :4;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word grpPERA :8;
  } MergedBits;
} PERABSTR;
extern volatile PERABSTR _PERAB @0x00000226;
#define PERAB                           _PERAB.Word
#define PERAB_PERB0                     _PERAB.Bits.PERB0
#define PERAB_PERB1                     _PERAB.Bits.PERB1
#define PERAB_PERB2                     _PERAB.Bits.PERB2
#define PERAB_PERB3                     _PERAB.Bits.PERB3
#define PERAB_PERA0                     _PERAB.Bits.PERA0
#define PERAB_PERA1                     _PERAB.Bits.PERA1
#define PERAB_PERA2                     _PERAB.Bits.PERA2
#define PERAB_PERA3                     _PERAB.Bits.PERA3
#define PERAB_PERA4                     _PERAB.Bits.PERA4
#define PERAB_PERA5                     _PERAB.Bits.PERA5
#define PERAB_PERA6                     _PERAB.Bits.PERA6
#define PERAB_PERA7                     _PERAB.Bits.PERA7
#define PERAB_PERB                      _PERAB.MergedBits.grpPERB
#define PERAB_PERA                      _PERAB.MergedBits.grpPERA

#define PERAB_PERB0_MASK                1U
#define PERAB_PERB1_MASK                2U
#define PERAB_PERB2_MASK                4U
#define PERAB_PERB3_MASK                8U
#define PERAB_PERA0_MASK                256U
#define PERAB_PERA1_MASK                512U
#define PERAB_PERA2_MASK                1024U
#define PERAB_PERA3_MASK                2048U
#define PERAB_PERA4_MASK                4096U
#define PERAB_PERA5_MASK                8192U
#define PERAB_PERA6_MASK                16384U
#define PERAB_PERA7_MASK                32768U
#define PERAB_PERB_MASK                 15U
#define PERAB_PERB_BITNUM               0U
#define PERAB_PERA_MASK                 65280U
#define PERAB_PERA_BITNUM               8U


/*** PPSAB - Port AB Polarity Select Register; 0x00000228 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PPSA - Port A Polarity Select Register; 0x00000228 ***/
    union {
      byte Byte;
      struct {
        byte PPSA0       :1;                                       /* Port A pull polarity select 0 */
        byte PPSA1       :1;                                       /* Port A pull polarity select 1 */
        byte PPSA2       :1;                                       /* Port A pull polarity select 2 */
        byte PPSA3       :1;                                       /* Port A pull polarity select 3 */
        byte PPSA4       :1;                                       /* Port A pull polarity select 4 */
        byte PPSA5       :1;                                       /* Port A pull polarity select 5 */
        byte PPSA6       :1;                                       /* Port A pull polarity select 6 */
        byte PPSA7       :1;                                       /* Port A pull polarity select 7 */
      } Bits;
    } PPSASTR;
    #define PPSA                        _PPSAB.Overlap_STR.PPSASTR.Byte
    #define PPSA_PPSA0                  _PPSAB.Overlap_STR.PPSASTR.Bits.PPSA0
    #define PPSA_PPSA1                  _PPSAB.Overlap_STR.PPSASTR.Bits.PPSA1
    #define PPSA_PPSA2                  _PPSAB.Overlap_STR.PPSASTR.Bits.PPSA2
    #define PPSA_PPSA3                  _PPSAB.Overlap_STR.PPSASTR.Bits.PPSA3
    #define PPSA_PPSA4                  _PPSAB.Overlap_STR.PPSASTR.Bits.PPSA4
    #define PPSA_PPSA5                  _PPSAB.Overlap_STR.PPSASTR.Bits.PPSA5
    #define PPSA_PPSA6                  _PPSAB.Overlap_STR.PPSASTR.Bits.PPSA6
    #define PPSA_PPSA7                  _PPSAB.Overlap_STR.PPSASTR.Bits.PPSA7
    
