ClearDotX/TRK-KEA8_128/LINStack/Examples/S12Z_examples/Lumen_S12ZVHY64/S12ZVHY64_Master/Project_Headers/mc9s12zvhy64.h
  struct {
    word PTD0        :1;                                       /* Port CD general purpose I/O data 0 */
    word PTD1        :1;                                       /* Port CD general purpose I/O data 1 */
    word PTD2        :1;                                       /* Port CD general purpose I/O data 2 */
    word PTD3        :1;                                       /* Port CD general purpose I/O data 3 */
    word PTD4        :1;                                       /* Port CD general purpose I/O data 4 */
    word PTD5        :1;                                       /* Port CD general purpose I/O data 5 */
    word PTD6        :1;                                       /* Port CD general purpose I/O data 6 */
    word PTD7        :1;                                       /* Port CD general purpose I/O data 7 */
    word PTC0        :1;                                       /* Port CD general purpose I/O data 8 */
    word PTC1        :1;                                       /* Port CD general purpose I/O data 9 */
    word PTC2        :1;                                       /* Port CD general purpose I/O data 10 */
    word PTC3        :1;                                       /* Port CD general purpose I/O data 11 */
    word PTC4        :1;                                       /* Port CD general purpose I/O data 12 */
    word PTC5        :1;                                       /* Port CD general purpose I/O data 13 */
    word PTC6        :1;                                       /* Port CD general purpose I/O data 14 */
    word PTC7        :1;                                       /* Port CD general purpose I/O data 15 */
  } Bits;
  struct {
    word grpPTD  :8;
    word grpPTC  :8;
  } MergedBits;
} PTCDSTR;
extern volatile PTCDSTR _PTCD @0x00000240;
#define PTCD                            _PTCD.Word
#define PTCD_PTD0                       _PTCD.Bits.PTD0
#define PTCD_PTD1                       _PTCD.Bits.PTD1
#define PTCD_PTD2                       _PTCD.Bits.PTD2
#define PTCD_PTD3                       _PTCD.Bits.PTD3
#define PTCD_PTD4                       _PTCD.Bits.PTD4
#define PTCD_PTD5                       _PTCD.Bits.PTD5
#define PTCD_PTD6                       _PTCD.Bits.PTD6
#define PTCD_PTD7                       _PTCD.Bits.PTD7
#define PTCD_PTC0                       _PTCD.Bits.PTC0
#define PTCD_PTC1                       _PTCD.Bits.PTC1
#define PTCD_PTC2                       _PTCD.Bits.PTC2
#define PTCD_PTC3                       _PTCD.Bits.PTC3
#define PTCD_PTC4                       _PTCD.Bits.PTC4
#define PTCD_PTC5                       _PTCD.Bits.PTC5
#define PTCD_PTC6                       _PTCD.Bits.PTC6
#define PTCD_PTC7                       _PTCD.Bits.PTC7
#define PTCD_PTD                        _PTCD.MergedBits.grpPTD
#define PTCD_PTC                        _PTCD.MergedBits.grpPTC

#define PTCD_PTD0_MASK                  1U
#define PTCD_PTD1_MASK                  2U
#define PTCD_PTD2_MASK                  4U
#define PTCD_PTD3_MASK                  8U
#define PTCD_PTD4_MASK                  16U
#define PTCD_PTD5_MASK                  32U
#define PTCD_PTD6_MASK                  64U
#define PTCD_PTD7_MASK                  128U
#define PTCD_PTC0_MASK                  256U
#define PTCD_PTC1_MASK                  512U
#define PTCD_PTC2_MASK                  1024U
#define PTCD_PTC3_MASK                  2048U
#define PTCD_PTC4_MASK                  4096U
#define PTCD_PTC5_MASK                  8192U
#define PTCD_PTC6_MASK                  16384U
#define PTCD_PTC7_MASK                  32768U
#define PTCD_PTD_MASK                   255U
#define PTCD_PTD_BITNUM                 0U
#define PTCD_PTC_MASK                   65280U
#define PTCD_PTC_BITNUM                 8U


/*** PTICD - Port CD Input Register; 0x00000242 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PTIC - Port C Input Register; 0x00000242 ***/
    union {
      byte Byte;
      struct {
        byte PTIC0       :1;                                       /* Port C data input 0 */
        byte PTIC1       :1;                                       /* Port C data input 1 */
        byte PTIC2       :1;                                       /* Port C data input 2 */
        byte PTIC3       :1;                                       /* Port C data input 3 */
        byte PTIC4       :1;                                       /* Port C data input 4 */
        byte PTIC5       :1;                                       /* Port C data input 5 */
        byte PTIC6       :1;                                       /* Port C data input 6 */
        byte PTIC7       :1;                                       /* Port C data input 7 */
      } Bits;
    } PTICSTR;
    #define PTIC                        _PTICD.Overlap_STR.PTICSTR.Byte
    #define PTIC_PTIC0                  _PTICD.Overlap_STR.PTICSTR.Bits.PTIC0
    #define PTIC_PTIC1                  _PTICD.Overlap_STR.PTICSTR.Bits.PTIC1
    #define PTIC_PTIC2                  _PTICD.Overlap_STR.PTICSTR.Bits.PTIC2
    #define PTIC_PTIC3                  _PTICD.Overlap_STR.PTICSTR.Bits.PTIC3
    #define PTIC_PTIC4                  _PTICD.Overlap_STR.PTICSTR.Bits.PTIC4
    #define PTIC_PTIC5                  _PTICD.Overlap_STR.PTICSTR.Bits.PTIC5
    #define PTIC_PTIC6                  _PTICD.Overlap_STR.PTICSTR.Bits.PTIC6
    #define PTIC_PTIC7                  _PTICD.Overlap_STR.PTICSTR.Bits.PTIC7
    
    #define PTIC_PTIC0_MASK             1U
    #define PTIC_PTIC1_MASK             2U
    #define PTIC_PTIC2_MASK             4U
    #define PTIC_PTIC3_MASK             8U
    #define PTIC_PTIC4_MASK             16U
    #define PTIC_PTIC5_MASK             32U
    #define PTIC_PTIC6_MASK             64U
    #define PTIC_PTIC7_MASK             128U
    

    /*** PTID - Port D Input Register; 0x00000243 ***/
    union {
      byte Byte;
      struct {
        byte PTID0       :1;                                       /* Port D data input 0 */
        byte PTID1       :1;                                       /* Port D data input 1 */
        byte PTID2       :1;                                       /* Port D data input 2 */
        byte PTID3       :1;                                       /* Port D data input 3 */
        byte PTID4       :1;                                       /* Port D data input 4 */
        byte PTID5       :1;                                       /* Port D data input 5 */
        byte PTID6       :1;                                       /* Port D data input 6 */
        byte PTID7       :1;                                       /* Port D data input 7 */
      } Bits;
    } PTIDSTR;
    #define PTID                        _PTICD.Overlap_STR.PTIDSTR.Byte
    #define PTID_PTID0                  _PTICD.Overlap_STR.PTIDSTR.Bits.PTID0
    #define PTID_PTID1                  _PTICD.Overlap_STR.PTIDSTR.Bits.PTID1
    #define PTID_PTID2                  _PTICD.Overlap_STR.PTIDSTR.Bits.PTID2
    #define PTID_PTID3                  _PTICD.Overlap_STR.PTIDSTR.Bits.PTID3
    #define PTID_PTID4                  _PTICD.Overlap_STR.PTIDSTR.Bits.PTID4
    #define PTID_PTID5                  _PTICD.Overlap_STR.PTIDSTR.Bits.PTID5
    #define PTID_PTID6                  _PTICD.Overlap_STR.PTIDSTR.Bits.PTID6
    #define PTID_PTID7                  _PTICD.Overlap_STR.PTIDSTR.Bits.PTID7
    
    #define PTID_PTID0_MASK             1U
    #define PTID_PTID1_MASK             2U
    #define PTID_PTID2_MASK             4U
    #define PTID_PTID3_MASK             8U
    #define PTID_PTID4_MASK             16U
    #define PTID_PTID5_MASK             32U
    #define PTID_PTID6_MASK             64U
    #define PTID_PTID7_MASK             128U
    
  } Overlap_STR;

