ClearDotX/TRK-KEA8_128/LINStack/Examples/S12Z_examples/Lumen_S12ZVHY64/S12ZVHY64_Master/Project_Headers/mc9s12zvhy64.h
  struct {
    word PTID0       :1;                                       /* Port CD data input 0 */
    word PTID1       :1;                                       /* Port CD data input 1 */
    word PTID2       :1;                                       /* Port CD data input 2 */
    word PTID3       :1;                                       /* Port CD data input 3 */
    word PTID4       :1;                                       /* Port CD data input 4 */
    word PTID5       :1;                                       /* Port CD data input 5 */
    word PTID6       :1;                                       /* Port CD data input 6 */
    word PTID7       :1;                                       /* Port CD data input 7 */
    word PTIC0       :1;                                       /* Port CD data input 0 */
    word PTIC1       :1;                                       /* Port CD data input 1 */
    word PTIC2       :1;                                       /* Port CD data input 2 */
    word PTIC3       :1;                                       /* Port CD data input 3 */
    word PTIC4       :1;                                       /* Port CD data input 4 */
    word PTIC5       :1;                                       /* Port CD data input 5 */
    word PTIC6       :1;                                       /* Port CD data input 6 */
    word PTIC7       :1;                                       /* Port CD data input 7 */
  } Bits;
  struct {
    word grpPTID :8;
    word grpPTIC :8;
  } MergedBits;
} PTICDSTR;
extern volatile PTICDSTR _PTICD @0x00000242;
#define PTICD                           _PTICD.Word
#define PTICD_PTID0                     _PTICD.Bits.PTID0
#define PTICD_PTID1                     _PTICD.Bits.PTID1
#define PTICD_PTID2                     _PTICD.Bits.PTID2
#define PTICD_PTID3                     _PTICD.Bits.PTID3
#define PTICD_PTID4                     _PTICD.Bits.PTID4
#define PTICD_PTID5                     _PTICD.Bits.PTID5
#define PTICD_PTID6                     _PTICD.Bits.PTID6
#define PTICD_PTID7                     _PTICD.Bits.PTID7
#define PTICD_PTIC0                     _PTICD.Bits.PTIC0
#define PTICD_PTIC1                     _PTICD.Bits.PTIC1
#define PTICD_PTIC2                     _PTICD.Bits.PTIC2
#define PTICD_PTIC3                     _PTICD.Bits.PTIC3
#define PTICD_PTIC4                     _PTICD.Bits.PTIC4
#define PTICD_PTIC5                     _PTICD.Bits.PTIC5
#define PTICD_PTIC6                     _PTICD.Bits.PTIC6
#define PTICD_PTIC7                     _PTICD.Bits.PTIC7
#define PTICD_PTID                      _PTICD.MergedBits.grpPTID
#define PTICD_PTIC                      _PTICD.MergedBits.grpPTIC

#define PTICD_PTID0_MASK                1U
#define PTICD_PTID1_MASK                2U
#define PTICD_PTID2_MASK                4U
#define PTICD_PTID3_MASK                8U
#define PTICD_PTID4_MASK                16U
#define PTICD_PTID5_MASK                32U
#define PTICD_PTID6_MASK                64U
#define PTICD_PTID7_MASK                128U
#define PTICD_PTIC0_MASK                256U
#define PTICD_PTIC1_MASK                512U
#define PTICD_PTIC2_MASK                1024U
#define PTICD_PTIC3_MASK                2048U
#define PTICD_PTIC4_MASK                4096U
#define PTICD_PTIC5_MASK                8192U
#define PTICD_PTIC6_MASK                16384U
#define PTICD_PTIC7_MASK                32768U
#define PTICD_PTID_MASK                 255U
#define PTICD_PTID_BITNUM               0U
#define PTICD_PTIC_MASK                 65280U
#define PTICD_PTIC_BITNUM               8U


/*** DDRCD - Port CD Data Direction Register; 0x00000244 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** DDRC - Port C Data Direction Register; 0x00000244 ***/
    union {
      byte Byte;
      struct {
        byte DDRC0       :1;                                       /* Port C data direction select 0 */
        byte DDRC1       :1;                                       /* Port C data direction select 1 */
        byte DDRC2       :1;                                       /* Port C data direction select 2 */
        byte DDRC3       :1;                                       /* Port C data direction select 3 */
        byte DDRC4       :1;                                       /* Port C data direction select 4 */
        byte DDRC5       :1;                                       /* Port C data direction select 5 */
        byte DDRC6       :1;                                       /* Port C data direction select 6 */
        byte DDRC7       :1;                                       /* Port C data direction select 7 */
      } Bits;
    } DDRCSTR;
    #define DDRC                        _DDRCD.Overlap_STR.DDRCSTR.Byte
    #define DDRC_DDRC0                  _DDRCD.Overlap_STR.DDRCSTR.Bits.DDRC0
    #define DDRC_DDRC1                  _DDRCD.Overlap_STR.DDRCSTR.Bits.DDRC1
    #define DDRC_DDRC2                  _DDRCD.Overlap_STR.DDRCSTR.Bits.DDRC2
    #define DDRC_DDRC3                  _DDRCD.Overlap_STR.DDRCSTR.Bits.DDRC3
    #define DDRC_DDRC4                  _DDRCD.Overlap_STR.DDRCSTR.Bits.DDRC4
    #define DDRC_DDRC5                  _DDRCD.Overlap_STR.DDRCSTR.Bits.DDRC5
    #define DDRC_DDRC6                  _DDRCD.Overlap_STR.DDRCSTR.Bits.DDRC6
    #define DDRC_DDRC7                  _DDRCD.Overlap_STR.DDRCSTR.Bits.DDRC7
    
    #define DDRC_DDRC0_MASK             1U
    #define DDRC_DDRC1_MASK             2U
    #define DDRC_DDRC2_MASK             4U
    #define DDRC_DDRC3_MASK             8U
    #define DDRC_DDRC4_MASK             16U
    #define DDRC_DDRC5_MASK             32U
    #define DDRC_DDRC6_MASK             64U
    #define DDRC_DDRC7_MASK             128U
    

    /*** DDRD - Port D Data Direction Register; 0x00000245 ***/
    union {
      byte Byte;
      struct {
        byte DDRD0       :1;                                       /* Port D data direction select 0 */
        byte DDRD1       :1;                                       /* Port D data direction select 1 */
        byte DDRD2       :1;                                       /* Port D data direction select 2 */
        byte DDRD3       :1;                                       /* Port D data direction select 3 */
        byte DDRD4       :1;                                       /* Port D data direction select 4 */
        byte DDRD5       :1;                                       /* Port D data direction select 5 */
        byte DDRD6       :1;                                       /* Port D data direction select 6 */
        byte DDRD7       :1;                                       /* Port D data direction select 7 */
      } Bits;
    } DDRDSTR;
    #define DDRD                        _DDRCD.Overlap_STR.DDRDSTR.Byte
    #define DDRD_DDRD0                  _DDRCD.Overlap_STR.DDRDSTR.Bits.DDRD0
    #define DDRD_DDRD1                  _DDRCD.Overlap_STR.DDRDSTR.Bits.DDRD1
    #define DDRD_DDRD2                  _DDRCD.Overlap_STR.DDRDSTR.Bits.DDRD2
    #define DDRD_DDRD3                  _DDRCD.Overlap_STR.DDRDSTR.Bits.DDRD3
    #define DDRD_DDRD4                  _DDRCD.Overlap_STR.DDRDSTR.Bits.DDRD4
    #define DDRD_DDRD5                  _DDRCD.Overlap_STR.DDRDSTR.Bits.DDRD5
    #define DDRD_DDRD6                  _DDRCD.Overlap_STR.DDRDSTR.Bits.DDRD6
    #define DDRD_DDRD7                  _DDRCD.Overlap_STR.DDRDSTR.Bits.DDRD7
    
