ClearDotX/TRK-KEA8_128/LINStack/Examples/S12Z_examples/Lumen_S12ZVHY64/S12ZVHY64_Master/Project_Headers/mc9s12zvhy64.h
    #define PERD_PERD0_MASK             1U
    #define PERD_PERD1_MASK             2U
    #define PERD_PERD2_MASK             4U
    #define PERD_PERD3_MASK             8U
    #define PERD_PERD4_MASK             16U
    #define PERD_PERD5_MASK             32U
    #define PERD_PERD6_MASK             64U
    #define PERD_PERD7_MASK             128U
    
  } Overlap_STR;

  struct {
    word PERD0       :1;                                       /* Port CD pull device enable 0 */
    word PERD1       :1;                                       /* Port CD pull device enable 1 */
    word PERD2       :1;                                       /* Port CD pull device enable 2 */
    word PERD3       :1;                                       /* Port CD pull device enable 3 */
    word PERD4       :1;                                       /* Port CD pull device enable 4 */
    word PERD5       :1;                                       /* Port CD pull device enable 5 */
    word PERD6       :1;                                       /* Port CD pull device enable 6 */
    word PERD7       :1;                                       /* Port CD pull device enable 7 */
    word PERC0       :1;                                       /* Port CD pull device enable 8 */
    word PERC1       :1;                                       /* Port CD pull device enable 9 */
    word PERC2       :1;                                       /* Port CD pull device enable 10 */
    word PERC3       :1;                                       /* Port CD pull device enable 11 */
    word PERC4       :1;                                       /* Port CD pull device enable 12 */
    word PERC5       :1;                                       /* Port CD pull device enable 13 */
    word PERC6       :1;                                       /* Port CD pull device enable 14 */
    word PERC7       :1;                                       /* Port CD pull device enable 15 */
  } Bits;
  struct {
    word grpPERD :8;
    word grpPERC :8;
  } MergedBits;
} PERCDSTR;
extern volatile PERCDSTR _PERCD @0x00000246;
#define PERCD                           _PERCD.Word
#define PERCD_PERD0                     _PERCD.Bits.PERD0
#define PERCD_PERD1                     _PERCD.Bits.PERD1
#define PERCD_PERD2                     _PERCD.Bits.PERD2
#define PERCD_PERD3                     _PERCD.Bits.PERD3
#define PERCD_PERD4                     _PERCD.Bits.PERD4
#define PERCD_PERD5                     _PERCD.Bits.PERD5
#define PERCD_PERD6                     _PERCD.Bits.PERD6
#define PERCD_PERD7                     _PERCD.Bits.PERD7
#define PERCD_PERC0                     _PERCD.Bits.PERC0
#define PERCD_PERC1                     _PERCD.Bits.PERC1
#define PERCD_PERC2                     _PERCD.Bits.PERC2
#define PERCD_PERC3                     _PERCD.Bits.PERC3
#define PERCD_PERC4                     _PERCD.Bits.PERC4
#define PERCD_PERC5                     _PERCD.Bits.PERC5
#define PERCD_PERC6                     _PERCD.Bits.PERC6
#define PERCD_PERC7                     _PERCD.Bits.PERC7
#define PERCD_PERD                      _PERCD.MergedBits.grpPERD
#define PERCD_PERC                      _PERCD.MergedBits.grpPERC

#define PERCD_PERD0_MASK                1U
#define PERCD_PERD1_MASK                2U
#define PERCD_PERD2_MASK                4U
#define PERCD_PERD3_MASK                8U
#define PERCD_PERD4_MASK                16U
#define PERCD_PERD5_MASK                32U
#define PERCD_PERD6_MASK                64U
#define PERCD_PERD7_MASK                128U
#define PERCD_PERC0_MASK                256U
#define PERCD_PERC1_MASK                512U
#define PERCD_PERC2_MASK                1024U
#define PERCD_PERC3_MASK                2048U
#define PERCD_PERC4_MASK                4096U
#define PERCD_PERC5_MASK                8192U
#define PERCD_PERC6_MASK                16384U
#define PERCD_PERC7_MASK                32768U
#define PERCD_PERD_MASK                 255U
#define PERCD_PERD_BITNUM               0U
#define PERCD_PERC_MASK                 65280U
#define PERCD_PERC_BITNUM               8U


/*** PPSCD - Port CD Polarity Select Register; 0x00000248 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PPSC - Port C Polarity Select Register; 0x00000248 ***/
    union {
      byte Byte;
      struct {
        byte PPSC0       :1;                                       /* Port C pull polarity select 0 */
        byte PPSC1       :1;                                       /* Port C pull polarity select 1 */
        byte PPSC2       :1;                                       /* Port C pull polarity select 2 */
        byte PPSC3       :1;                                       /* Port C pull polarity select 3 */
        byte PPSC4       :1;                                       /* Port C pull polarity select 4 */
        byte PPSC5       :1;                                       /* Port C pull polarity select 5 */
        byte PPSC6       :1;                                       /* Port C pull polarity select 6 */
        byte PPSC7       :1;                                       /* Port C pull polarity select 7 */
      } Bits;
    } PPSCSTR;
    #define PPSC                        _PPSCD.Overlap_STR.PPSCSTR.Byte
    #define PPSC_PPSC0                  _PPSCD.Overlap_STR.PPSCSTR.Bits.PPSC0
    #define PPSC_PPSC1                  _PPSCD.Overlap_STR.PPSCSTR.Bits.PPSC1
    #define PPSC_PPSC2                  _PPSCD.Overlap_STR.PPSCSTR.Bits.PPSC2
    #define PPSC_PPSC3                  _PPSCD.Overlap_STR.PPSCSTR.Bits.PPSC3
    #define PPSC_PPSC4                  _PPSCD.Overlap_STR.PPSCSTR.Bits.PPSC4
    #define PPSC_PPSC5                  _PPSCD.Overlap_STR.PPSCSTR.Bits.PPSC5
    #define PPSC_PPSC6                  _PPSCD.Overlap_STR.PPSCSTR.Bits.PPSC6
    #define PPSC_PPSC7                  _PPSCD.Overlap_STR.PPSCSTR.Bits.PPSC7
    
    #define PPSC_PPSC0_MASK             1U
    #define PPSC_PPSC1_MASK             2U
    #define PPSC_PPSC2_MASK             4U
    #define PPSC_PPSC3_MASK             8U
    #define PPSC_PPSC4_MASK             16U
    #define PPSC_PPSC5_MASK             32U
    #define PPSC_PPSC6_MASK             64U
    #define PPSC_PPSC7_MASK             128U
    

    /*** PPSD - Port D Polarity Select Register; 0x00000249 ***/
    union {
      byte Byte;
      struct {
        byte PPSD0       :1;                                       /* Port D pull polarity select 0 */
        byte PPSD1       :1;                                       /* Port D pull polarity select 1 */
        byte PPSD2       :1;                                       /* Port D pull polarity select 2 */
        byte PPSD3       :1;                                       /* Port D pull polarity select 3 */
        byte PPSD4       :1;                                       /* Port D pull polarity select 4 */
        byte PPSD5       :1;                                       /* Port D pull polarity select 5 */
        byte PPSD6       :1;                                       /* Port D pull polarity select 6 */
        byte PPSD7       :1;                                       /* Port D pull polarity select 7 */
      } Bits;
    } PPSDSTR;
    #define PPSD                        _PPSCD.Overlap_STR.PPSDSTR.Byte
    #define PPSD_PPSD0                  _PPSCD.Overlap_STR.PPSDSTR.Bits.PPSD0
    #define PPSD_PPSD1                  _PPSCD.Overlap_STR.PPSDSTR.Bits.PPSD1
    #define PPSD_PPSD2                  _PPSCD.Overlap_STR.PPSDSTR.Bits.PPSD2
    #define PPSD_PPSD3                  _PPSCD.Overlap_STR.PPSDSTR.Bits.PPSD3
    #define PPSD_PPSD4                  _PPSCD.Overlap_STR.PPSDSTR.Bits.PPSD4
    #define PPSD_PPSD5                  _PPSCD.Overlap_STR.PPSDSTR.Bits.PPSD5
    #define PPSD_PPSD6                  _PPSCD.Overlap_STR.PPSDSTR.Bits.PPSD6
    #define PPSD_PPSD7                  _PPSCD.Overlap_STR.PPSDSTR.Bits.PPSD7
    
