ClearDotX/TRK-KEA8_128/LINStack/Examples/S12Z_examples/Lumen_S12ZVHY64/S12ZVHY64_Master/Project_Headers/mc9s12zvhy64.h
  struct {
    word DDRF0       :1;                                       /* Port EF data direction select 0 */
    word DDRF1       :1;                                       /* Port EF data direction select 1 */
    word DDRF2       :1;                                       /* Port EF data direction select 2 */
    word DDRF3       :1;                                       /* Port EF data direction select 3 */
    word DDRF4       :1;                                       /* Port EF data direction select 4 */
    word DDRF5       :1;                                       /* Port EF data direction select 5 */
    word DDRF6       :1;                                       /* Port EF data direction select 6 */
    word DDRF7       :1;                                       /* Port EF data direction select 7 */
    word DDRE0       :1;                                       /* Port EF data direction select 8 */
    word DDRE1       :1;                                       /* Port EF data direction select 9 */
    word DDRE2       :1;                                       /* Port EF data direction select 10 */
    word DDRE3       :1;                                       /* Port EF data direction select 11 */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
  struct {
    word grpDDRF :8;
    word grpDDRE :4;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} DDREFSTR;
extern volatile DDREFSTR _DDREF @0x00000264;
#define DDREF                           _DDREF.Word
#define DDREF_DDRF0                     _DDREF.Bits.DDRF0
#define DDREF_DDRF1                     _DDREF.Bits.DDRF1
#define DDREF_DDRF2                     _DDREF.Bits.DDRF2
#define DDREF_DDRF3                     _DDREF.Bits.DDRF3
#define DDREF_DDRF4                     _DDREF.Bits.DDRF4
#define DDREF_DDRF5                     _DDREF.Bits.DDRF5
#define DDREF_DDRF6                     _DDREF.Bits.DDRF6
#define DDREF_DDRF7                     _DDREF.Bits.DDRF7
#define DDREF_DDRE0                     _DDREF.Bits.DDRE0
#define DDREF_DDRE1                     _DDREF.Bits.DDRE1
#define DDREF_DDRE2                     _DDREF.Bits.DDRE2
#define DDREF_DDRE3                     _DDREF.Bits.DDRE3
#define DDREF_DDRF                      _DDREF.MergedBits.grpDDRF
#define DDREF_DDRE                      _DDREF.MergedBits.grpDDRE

#define DDREF_DDRF0_MASK                1U
#define DDREF_DDRF1_MASK                2U
#define DDREF_DDRF2_MASK                4U
#define DDREF_DDRF3_MASK                8U
#define DDREF_DDRF4_MASK                16U
#define DDREF_DDRF5_MASK                32U
#define DDREF_DDRF6_MASK                64U
#define DDREF_DDRF7_MASK                128U
#define DDREF_DDRE0_MASK                256U
#define DDREF_DDRE1_MASK                512U
#define DDREF_DDRE2_MASK                1024U
#define DDREF_DDRE3_MASK                2048U
#define DDREF_DDRF_MASK                 255U
#define DDREF_DDRF_BITNUM               0U
#define DDREF_DDRE_MASK                 3840U
#define DDREF_DDRE_BITNUM               8U


/*** PEREF - Port EF Pull Up Enable Register; 0x00000266 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PERE - Port E Pull Device Enable Register; 0x00000266 ***/
    union {
      byte Byte;
      struct {
        byte PERE0       :1;                                       /* Port E pull device enable 0 */
        byte PERE1       :1;                                       /* Port E pull device enable 1 */
        byte PERE2       :1;                                       /* Port E pull device enable 2 */
        byte PERE3       :1;                                       /* Port E pull device enable 3 */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
      } Bits;
      struct {
        byte grpPERE :4;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } PERESTR;
    #define PERE                        _PEREF.Overlap_STR.PERESTR.Byte
    #define PERE_PERE0                  _PEREF.Overlap_STR.PERESTR.Bits.PERE0
    #define PERE_PERE1                  _PEREF.Overlap_STR.PERESTR.Bits.PERE1
    #define PERE_PERE2                  _PEREF.Overlap_STR.PERESTR.Bits.PERE2
    #define PERE_PERE3                  _PEREF.Overlap_STR.PERESTR.Bits.PERE3
    #define PERE_PERE                   _PEREF.Overlap_STR.PERESTR.MergedBits.grpPERE
    
    #define PERE_PERE0_MASK             1U
    #define PERE_PERE1_MASK             2U
    #define PERE_PERE2_MASK             4U
    #define PERE_PERE3_MASK             8U
    #define PERE_PERE_MASK              15U
    #define PERE_PERE_BITNUM            0U
    

    /*** PERF - Port F Pull Device Enable Register; 0x00000267 ***/
    union {
      byte Byte;
      struct {
        byte PERF0       :1;                                       /* Port F pull device enable 0 */
        byte PERF1       :1;                                       /* Port F pull device enable 1 */
        byte PERF2       :1;                                       /* Port F pull device enable 2 */
        byte PERF3       :1;                                       /* Port F pull device enable 3 */
        byte PERF4       :1;                                       /* Port F pull device enable 4 */
        byte PERF5       :1;                                       /* Port F pull device enable 5 */
        byte PERF6       :1;                                       /* Port F pull device enable 6 */
        byte PERF7       :1;                                       /* Port F pull device enable 7 */
      } Bits;
    } PERFSTR;
    #define PERF                        _PEREF.Overlap_STR.PERFSTR.Byte
    #define PERF_PERF0                  _PEREF.Overlap_STR.PERFSTR.Bits.PERF0
    #define PERF_PERF1                  _PEREF.Overlap_STR.PERFSTR.Bits.PERF1
    #define PERF_PERF2                  _PEREF.Overlap_STR.PERFSTR.Bits.PERF2
    #define PERF_PERF3                  _PEREF.Overlap_STR.PERFSTR.Bits.PERF3
    #define PERF_PERF4                  _PEREF.Overlap_STR.PERFSTR.Bits.PERF4
    #define PERF_PERF5                  _PEREF.Overlap_STR.PERFSTR.Bits.PERF5
    #define PERF_PERF6                  _PEREF.Overlap_STR.PERFSTR.Bits.PERF6
    #define PERF_PERF7                  _PEREF.Overlap_STR.PERFSTR.Bits.PERF7
    
    #define PERF_PERF0_MASK             1U
    #define PERF_PERF1_MASK             2U
    #define PERF_PERF2_MASK             4U
    #define PERF_PERF3_MASK             8U
    #define PERF_PERF4_MASK             16U
    #define PERF_PERF5_MASK             32U
    #define PERF_PERF6_MASK             64U
    #define PERF_PERF7_MASK             128U
    
  } Overlap_STR;

