ClearDotX/TRK-KEA8_128/LINStack/Examples/S12Z_examples/Lumen_S12ZVHY64/S12ZVHY64_Master/Project_Headers/mc9s12zvhy64.h
/*** PPSJ - Port J Polarity Select Register; 0x00000314 ***/
typedef union {
  byte Byte;
  struct {
    byte PPSJ0       :1;                                       /* Port J pull polarity select 0 */
    byte PPSJ1       :1;                                       /* Port J pull polarity select 1 */
    byte PPSJ2       :1;                                       /* Port J pull polarity select 2 */
    byte PPSJ3       :1;                                       /* Port J pull polarity select 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPPSJ :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PPSJSTR;
extern volatile PPSJSTR _PPSJ @0x00000314;
#define PPSJ                            _PPSJ.Byte
#define PPSJ_PPSJ0                      _PPSJ.Bits.PPSJ0
#define PPSJ_PPSJ1                      _PPSJ.Bits.PPSJ1
#define PPSJ_PPSJ2                      _PPSJ.Bits.PPSJ2
#define PPSJ_PPSJ3                      _PPSJ.Bits.PPSJ3
#define PPSJ_PPSJ                       _PPSJ.MergedBits.grpPPSJ

#define PPSJ_PPSJ0_MASK                 1U
#define PPSJ_PPSJ1_MASK                 2U
#define PPSJ_PPSJ2_MASK                 4U
#define PPSJ_PPSJ3_MASK                 8U
#define PPSJ_PPSJ_MASK                  15U
#define PPSJ_PPSJ_BITNUM                0U


/*** PTG - Port G Data Register; 0x00000320 ***/
typedef union {
  byte Byte;
  struct {
    byte PTG0        :1;                                       /* Port G general purpose I/O data 0 */
    byte PTG1        :1;                                       /* Port G general purpose I/O data 1 */
    byte PTG2        :1;                                       /* Port G general purpose I/O data 2 */
    byte PTG3        :1;                                       /* Port G general purpose I/O data 3 */
    byte PTG4        :1;                                       /* Port G general purpose I/O data 4 */
    byte PTG5        :1;                                       /* Port G general purpose I/O data 5 */
    byte PTG6        :1;                                       /* Port G general purpose I/O data 6 */
    byte PTG7        :1;                                       /* Port G general purpose I/O data 7 */
  } Bits;
} PTGSTR;
extern volatile PTGSTR _PTG @0x00000320;
#define PTG                             _PTG.Byte
#define PTG_PTG0                        _PTG.Bits.PTG0
#define PTG_PTG1                        _PTG.Bits.PTG1
#define PTG_PTG2                        _PTG.Bits.PTG2
#define PTG_PTG3                        _PTG.Bits.PTG3
#define PTG_PTG4                        _PTG.Bits.PTG4
#define PTG_PTG5                        _PTG.Bits.PTG5
#define PTG_PTG6                        _PTG.Bits.PTG6
#define PTG_PTG7                        _PTG.Bits.PTG7

#define PTG_PTG0_MASK                   1U
#define PTG_PTG1_MASK                   2U
#define PTG_PTG2_MASK                   4U
#define PTG_PTG3_MASK                   8U
#define PTG_PTG4_MASK                   16U
#define PTG_PTG5_MASK                   32U
#define PTG_PTG6_MASK                   64U
#define PTG_PTG7_MASK                   128U


/*** PTIG - Port G Input Register; 0x00000321 ***/
typedef union {
  byte Byte;
  struct {
    byte PTIG0       :1;                                       /* Port G data input 0 */
    byte PTIG1       :1;                                       /* Port G data input 1 */
    byte PTIG2       :1;                                       /* Port G data input 2 */
    byte PTIG3       :1;                                       /* Port G data input 3 */
    byte PTIG4       :1;                                       /* Port G data input 4 */
    byte PTIG5       :1;                                       /* Port G data input 5 */
    byte PTIG6       :1;                                       /* Port G data input 6 */
    byte PTIG7       :1;                                       /* Port G data input 7 */
  } Bits;
} PTIGSTR;
extern volatile PTIGSTR _PTIG @0x00000321;
#define PTIG                            _PTIG.Byte
#define PTIG_PTIG0                      _PTIG.Bits.PTIG0
#define PTIG_PTIG1                      _PTIG.Bits.PTIG1
#define PTIG_PTIG2                      _PTIG.Bits.PTIG2
#define PTIG_PTIG3                      _PTIG.Bits.PTIG3
#define PTIG_PTIG4                      _PTIG.Bits.PTIG4
#define PTIG_PTIG5                      _PTIG.Bits.PTIG5
#define PTIG_PTIG6                      _PTIG.Bits.PTIG6
#define PTIG_PTIG7                      _PTIG.Bits.PTIG7

#define PTIG_PTIG0_MASK                 1U
#define PTIG_PTIG1_MASK                 2U
#define PTIG_PTIG2_MASK                 4U
#define PTIG_PTIG3_MASK                 8U
#define PTIG_PTIG4_MASK                 16U
#define PTIG_PTIG5_MASK                 32U
#define PTIG_PTIG6_MASK                 64U
#define PTIG_PTIG7_MASK                 128U


/*** DDRG - Port G Data Direction Register; 0x00000322 ***/
typedef union {
  byte Byte;
  struct {
    byte DDRG0       :1;                                       /* Port G data direction select 0 */
    byte DDRG1       :1;                                       /* Port G data direction select 1 */
    byte DDRG2       :1;                                       /* Port G data direction select 2 */
    byte DDRG3       :1;                                       /* Port G data direction select 3 */
    byte DDRG4       :1;                                       /* Port G data direction select 4 */
    byte DDRG5       :1;                                       /* Port G data direction select 5 */
    byte DDRG6       :1;                                       /* Port G data direction select 6 */
    byte DDRG7       :1;                                       /* Port G data direction select 7 */
  } Bits;
} DDRGSTR;
extern volatile DDRGSTR _DDRG @0x00000322;
#define DDRG                            _DDRG.Byte
#define DDRG_DDRG0                      _DDRG.Bits.DDRG0
#define DDRG_DDRG1                      _DDRG.Bits.DDRG1
#define DDRG_DDRG2                      _DDRG.Bits.DDRG2
#define DDRG_DDRG3                      _DDRG.Bits.DDRG3
#define DDRG_DDRG4                      _DDRG.Bits.DDRG4
#define DDRG_DDRG5                      _DDRG.Bits.DDRG5
#define DDRG_DDRG6                      _DDRG.Bits.DDRG6
#define DDRG_DDRG7                      _DDRG.Bits.DDRG7

#define DDRG_DDRG0_MASK                 1U
#define DDRG_DDRG1_MASK                 2U
#define DDRG_DDRG2_MASK                 4U
#define DDRG_DDRG3_MASK                 8U
#define DDRG_DDRG4_MASK                 16U
#define DDRG_DDRG5_MASK                 32U
#define DDRG_DDRG6_MASK                 64U
#define DDRG_DDRG7_MASK                 128U


/*** PERG - Port G Pull Device Enable Register; 0x00000323 ***/
typedef union {
  byte Byte;
  struct {
    byte PERG0       :1;                                       /* Port G pull device enable 0 */
    byte PERG1       :1;                                       /* Port G pull device enable 1 */
    byte PERG2       :1;                                       /* Port G pull device enable 2 */
    byte PERG3       :1;                                       /* Port G pull device enable 3 */
    byte PERG4       :1;                                       /* Port G pull device enable 4 */
    byte PERG5       :1;                                       /* Port G pull device enable 5 */
    byte PERG6       :1;                                       /* Port G pull device enable 6 */
    byte PERG7       :1;                                       /* Port G pull device enable 7 */
  } Bits;
} PERGSTR;
extern volatile PERGSTR _PERG @0x00000323;
#define PERG                            _PERG.Byte
#define PERG_PERG0                      _PERG.Bits.PERG0
#define PERG_PERG1                      _PERG.Bits.PERG1
#define PERG_PERG2                      _PERG.Bits.PERG2
#define PERG_PERG3                      _PERG.Bits.PERG3
#define PERG_PERG4                      _PERG.Bits.PERG4
#define PERG_PERG5                      _PERG.Bits.PERG5
#define PERG_PERG6                      _PERG.Bits.PERG6
#define PERG_PERG7                      _PERG.Bits.PERG7

#define PERG_PERG0_MASK                 1U
#define PERG_PERG1_MASK                 2U
#define PERG_PERG2_MASK                 4U
#define PERG_PERG3_MASK                 8U
#define PERG_PERG4_MASK                 16U
#define PERG_PERG5_MASK                 32U
#define PERG_PERG6_MASK                 64U
#define PERG_PERG7_MASK                 128U


/*** PPSG - Port G Polarity Select Register; 0x00000324 ***/
typedef union {
  byte Byte;
  struct {
    byte PPSG0       :1;                                       /* Port G pull polarity select 0 */
    byte PPSG1       :1;                                       /* Port G pull polarity select 1 */
    byte PPSG2       :1;                                       /* Port G pull polarity select 2 */
    byte PPSG3       :1;                                       /* Port G pull polarity select 3 */
    byte PPSG4       :1;                                       /* Port G pull polarity select 4 */
    byte PPSG5       :1;                                       /* Port G pull polarity select 5 */
    byte PPSG6       :1;                                       /* Port G pull polarity select 6 */
    byte PPSG7       :1;                                       /* Port G pull polarity select 7 */
  } Bits;
} PPSGSTR;
extern volatile PPSGSTR _PPSG @0x00000324;
#define PPSG                            _PPSG.Byte
#define PPSG_PPSG0                      _PPSG.Bits.PPSG0
#define PPSG_PPSG1                      _PPSG.Bits.PPSG1
#define PPSG_PPSG2                      _PPSG.Bits.PPSG2
#define PPSG_PPSG3                      _PPSG.Bits.PPSG3
#define PPSG_PPSG4                      _PPSG.Bits.PPSG4
#define PPSG_PPSG5                      _PPSG.Bits.PPSG5
#define PPSG_PPSG6                      _PPSG.Bits.PPSG6
#define PPSG_PPSG7                      _PPSG.Bits.PPSG7

#define PPSG_PPSG0_MASK                 1U
#define PPSG_PPSG1_MASK                 2U
#define PPSG_PPSG2_MASK                 4U
#define PPSG_PPSG3_MASK                 8U
#define PPSG_PPSG4_MASK                 16U
#define PPSG_PPSG5_MASK                 32U
#define PPSG_PPSG6_MASK                 64U
#define PPSG_PPSG7_MASK                 128U


/*** PTU - Port U Data Register; 0x00000350 ***/
typedef union {
  byte Byte;
  struct {
    byte PTU0        :1;                                       /* Port U general purpose I/O data 0 */
    byte PTU1        :1;                                       /* Port U general purpose I/O data 1 */
    byte PTU2        :1;                                       /* Port U general purpose I/O data 2 */
    byte PTU3        :1;                                       /* Port U general purpose I/O data 3 */
    byte PTU4        :1;                                       /* Port U general purpose I/O data 4 */
    byte PTU5        :1;                                       /* Port U general purpose I/O data 5 */
    byte PTU6        :1;                                       /* Port U general purpose I/O data 6 */
    byte PTU7        :1;                                       /* Port U general purpose I/O data 7 */
  } Bits;
} PTUSTR;
extern volatile PTUSTR _PTU @0x00000350;
#define PTU                             _PTU.Byte
#define PTU_PTU0                        _PTU.Bits.PTU0
#define PTU_PTU1                        _PTU.Bits.PTU1
#define PTU_PTU2                        _PTU.Bits.PTU2
#define PTU_PTU3                        _PTU.Bits.PTU3
#define PTU_PTU4                        _PTU.Bits.PTU4
#define PTU_PTU5                        _PTU.Bits.PTU5
#define PTU_PTU6                        _PTU.Bits.PTU6
#define PTU_PTU7                        _PTU.Bits.PTU7

#define PTU_PTU0_MASK                   1U
#define PTU_PTU1_MASK                   2U
#define PTU_PTU2_MASK                   4U
#define PTU_PTU3_MASK                   8U
#define PTU_PTU4_MASK                   16U
#define PTU_PTU5_MASK                   32U
#define PTU_PTU6_MASK                   64U
#define PTU_PTU7_MASK                   128U


/*** PTIU - Port U Input Register; 0x00000351 ***/
typedef union {
  byte Byte;
  struct {
    byte PTIU0       :1;                                       /* Port U data input 0 */
    byte PTIU1       :1;                                       /* Port U data input 1 */
    byte PTIU2       :1;                                       /* Port U data input 2 */
    byte PTIU3       :1;                                       /* Port U data input 3 */
    byte PTIU4       :1;                                       /* Port U data input 4 */
    byte PTIU5       :1;                                       /* Port U data input 5 */
    byte PTIU6       :1;                                       /* Port U data input 6 */
    byte PTIU7       :1;                                       /* Port U data input 7 */
  } Bits;
} PTIUSTR;
