ClearDotX/TRK-KEA8_128/LINStack/Examples/S12Z_examples/Lumen_S12ZVHY64/S12ZVHY64_Master/Project_Headers/mc9s12zvhy64.h
#define SSG0AMP_AMP_MASK                2047U
#define SSG0AMP_AMP_BITNUM              0U


/*** SSG0AA - SSG Amplitude Adjustment; 0x00000B08 ***/
typedef union {
  word Word;
  struct {
    word AA          :11;                                      /* SSG Amplitude Adjustment Register Bits */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
} SSG0AASTR;
extern volatile SSG0AASTR _SSG0AA @0x00000B08;
#define SSG0AA                          _SSG0AA.Word
#define SSG0AA_AA                       _SSG0AA.Bits.AA

#define SSG0AA_AA_MASK                  2047U
#define SSG0AA_AA_BITNUM                0U


/*** SSG0AT - SSG Amplitude Threshold Register; 0x00000B0A ***/
typedef union {
  word Word;
  struct {
    word AT          :11;                                      /* SSG Amplitude Threshold Register Bits */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
} SSG0ATSTR;
extern volatile SSG0ATSTR _SSG0AT @0x00000B0A;
#define SSG0AT                          _SSG0AT.Word
#define SSG0AT_AT                       _SSG0AT.Bits.AT

#define SSG0AT_AT_MASK                  2047U
#define SSG0AT_AT_BITNUM                0U


/*** SSG0DUR - SSG Tone Duration register; 0x00000B0C ***/
typedef union {
  byte Byte;
} SSG0DURSTR;
extern volatile SSG0DURSTR _SSG0DUR @0x00000B0C;
#define SSG0DUR                         _SSG0DUR.Byte


/*** SSG0IE - SSG Interrupt Enable; 0x00000B0D ***/
typedef union {
  byte Byte;
  struct {
    byte RNDIE       :1;                                       /* SSG Ready for Next Sound Data Interrupt Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} SSG0IESTR;
extern volatile SSG0IESTR _SSG0IE @0x00000B0D;
#define SSG0IE                          _SSG0IE.Byte
#define SSG0IE_RNDIE                    _SSG0IE.Bits.RNDIE

#define SSG0IE_RNDIE_MASK               1U


/*** SSG0IF - SSG Interrupt Flag Registers; 0x00000B0E ***/
typedef union {
  byte Byte;
  struct {
    byte RNDI        :1;                                       /* SSG Ready for Next Sound Data Interrupt */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} SSG0IFSTR;
extern volatile SSG0IFSTR _SSG0IF @0x00000B0E;
#define SSG0IF                          _SSG0IF.Byte
#define SSG0IF_RNDI                     _SSG0IF.Bits.RNDI

#define SSG0IF_RNDI_MASK                1U


/*** SSG0AMPB - Buffer Register of SSGAMP; 0x00000B10 ***/
typedef union {
  word Word;
  struct {
    word AMPB        :11;                                      /* SSGAMPB Bits */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
} SSG0AMPBSTR;
extern volatile SSG0AMPBSTR _SSG0AMPB @0x00000B10;
#define SSG0AMPB                        _SSG0AMPB.Word
#define SSG0AMPB_AMPB                   _SSG0AMPB.Bits.AMPB

#define SSG0AMPB_AMPB_MASK              2047U
#define SSG0AMPB_AMPB_BITNUM            0U


/*** SSG0DCNT - SSG Tone Duration Counter; 0x00000B12 ***/
typedef union {
  byte Byte;
} SSG0DCNTSTR;
extern volatile SSG0DCNTSTR _SSG0DCNT @0x00000B12;
#define SSG0DCNT                        _SSG0DCNT.Byte


/*** BAKEY0 - Backdoor Comparison Key 0; 0x00FFFE00 ***/
typedef union {
  word Word;
  struct {
    word KEY         :16;                                      /* Backdoor Comparison Key Bits */
  } Bits;
} BAKEY0STR;
/* Tip for register initialization in the user code:  const word BAKEY0_INIT @0x00FFFE00 = <BAKEY0_INITVAL>; */
#define _BAKEY0 (*(const BAKEY0STR *)0x00FFFE00)
#define BAKEY0                          _BAKEY0.Word
#define BAKEY0_KEY                      _BAKEY0.Bits.KEY
/* BAKEY_ARR: Access 4 BAKEYx registers in an array */
#define BAKEY_ARR                       ((volatile word *) &BAKEY0)

#define BAKEY0_KEY_MASK                 65535U
#define BAKEY0_KEY_BITNUM               0U


/*** BAKEY1 - Backdoor Comparison Key 1; 0x00FFFE02 ***/
typedef union {
  word Word;
  struct {
    word KEY         :16;                                      /* Backdoor Comparison Key Bits */
  } Bits;
} BAKEY1STR;
/* Tip for register initialization in the user code:  const word BAKEY1_INIT @0x00FFFE02 = <BAKEY1_INITVAL>; */
#define _BAKEY1 (*(const BAKEY1STR *)0x00FFFE02)
#define BAKEY1                          _BAKEY1.Word
#define BAKEY1_KEY                      _BAKEY1.Bits.KEY

#define BAKEY1_KEY_MASK                 65535U
#define BAKEY1_KEY_BITNUM               0U


/*** BAKEY2 - Backdoor Comparison Key 2; 0x00FFFE04 ***/
typedef union {
  word Word;
  struct {
    word KEY         :16;                                      /* Backdoor Comparison Key Bits */
  } Bits;
} BAKEY2STR;
/* Tip for register initialization in the user code:  const word BAKEY2_INIT @0x00FFFE04 = <BAKEY2_INITVAL>; */
#define _BAKEY2 (*(const BAKEY2STR *)0x00FFFE04)
#define BAKEY2                          _BAKEY2.Word
#define BAKEY2_KEY                      _BAKEY2.Bits.KEY

#define BAKEY2_KEY_MASK                 65535U
#define BAKEY2_KEY_BITNUM               0U


/*** BAKEY3 - Backdoor Comparison Key 3; 0x00FFFE06 ***/
typedef union {
  word Word;
  struct {
    word KEY         :16;                                      /* Backdoor Comparison Key Bits */
  } Bits;
} BAKEY3STR;
/* Tip for register initialization in the user code:  const word BAKEY3_INIT @0x00FFFE06 = <BAKEY3_INITVAL>; */
#define _BAKEY3 (*(const BAKEY3STR *)0x00FFFE06)
#define BAKEY3                          _BAKEY3.Word
#define BAKEY3_KEY                      _BAKEY3.Bits.KEY

#define BAKEY3_KEY_MASK                 65535U
#define BAKEY3_KEY_BITNUM               0U


