ClearDotX/TRK-KEA8_128/LINStack/Examples/S12Z_examples/Lumen_S12ZVHY64/S12ZVHY64_Master/Project_Headers/mc9s12zvhy64.h
/*** NVFSEC - Non Volatile Flash Security Register; 0x00FFFE0F ***/
typedef union {
  byte Byte;
  struct {
    byte SEC0        :1;                                       /* Flash Security Bit 0 */
    byte SEC1        :1;                                       /* Flash Security Bit 1 */
    byte RNV2        :1;                                       /* Reserved Nonvolatile Bit 2 */
    byte RNV3        :1;                                       /* Reserved Nonvolatile Bit 3 */
    byte RNV4        :1;                                       /* Reserved Nonvolatile Bit 4 */
    byte RNV5        :1;                                       /* Reserved Nonvolatile Bit 5 */
    byte KEYEN0      :1;                                       /* Backdoor Key Security Enable Bit 0 */
    byte KEYEN1      :1;                                       /* Backdoor Key Security Enable Bit 1 */
  } Bits;
  struct {
    byte grpSEC  :2;
    byte grpRNV_2 :4;
    byte grpKEYEN :2;
  } MergedBits;
} NVFSECSTR;
/* Tip for register initialization in the user code:  const byte NVFSEC_INIT @0x00FFFE0F = <NVFSEC_INITVAL>; */
#define _NVFSEC (*(const NVFSECSTR *)0x00FFFE0F)
#define NVFSEC                          _NVFSEC.Byte
#define NVFSEC_SEC0                     _NVFSEC.Bits.SEC0
#define NVFSEC_SEC1                     _NVFSEC.Bits.SEC1
#define NVFSEC_RNV2                     _NVFSEC.Bits.RNV2
#define NVFSEC_RNV3                     _NVFSEC.Bits.RNV3
#define NVFSEC_RNV4                     _NVFSEC.Bits.RNV4
#define NVFSEC_RNV5                     _NVFSEC.Bits.RNV5
#define NVFSEC_KEYEN0                   _NVFSEC.Bits.KEYEN0
#define NVFSEC_KEYEN1                   _NVFSEC.Bits.KEYEN1
#define NVFSEC_SEC                      _NVFSEC.MergedBits.grpSEC
#define NVFSEC_RNV_2                    _NVFSEC.MergedBits.grpRNV_2
#define NVFSEC_KEYEN                    _NVFSEC.MergedBits.grpKEYEN
#define NVFSEC_RNV                      NVFSEC_RNV_2

#define NVFSEC_SEC0_MASK                1U
#define NVFSEC_SEC1_MASK                2U
#define NVFSEC_RNV2_MASK                4U
#define NVFSEC_RNV3_MASK                8U
#define NVFSEC_RNV4_MASK                16U
#define NVFSEC_RNV5_MASK                32U
#define NVFSEC_KEYEN0_MASK              64U
#define NVFSEC_KEYEN1_MASK              128U
#define NVFSEC_SEC_MASK                 3U
#define NVFSEC_SEC_BITNUM               0U
#define NVFSEC_RNV_2_MASK               60U
#define NVFSEC_RNV_2_BITNUM             2U
#define NVFSEC_KEYEN_MASK               192U
#define NVFSEC_KEYEN_BITNUM             6U


/* * * * *  24-BIT ADDRESS REGISTERS  * * * * * * * * * * * * * * * * * * * * * * */
extern volatile void* volatile MMCPC @0x00000085;          /* Captured S12ZCPU Program Counter Low; 0x00000087 */
extern volatile void* volatile DBGAA @0x00000115;          /* Debug Comparator A Address Register Low; 0x00000117 */
extern volatile void* volatile DBGBA @0x00000125;          /* Debug Comparator B Address Register Low; 0x00000127 */
extern volatile void* volatile DBGCA @0x00000135;          /* Debug Comparator C Address Register Low; 0x00000137 */
extern volatile void* volatile DBGDA @0x00000145;          /* Debug Comparator D Address Register Low; 0x00000147 */
extern volatile void* volatile ECCDPTR @0x000003C7;        /* ECC Debug Point Register Low; 0x000003C9 */
extern volatile void* volatile ADC0CBP @0x0000061D;        /* ADC0 Command Base Pointer Register 0; 0x000003C9 */
extern volatile void* volatile ADC0RBP @0x00000621;        /* ADC0 Result Base Pointer Register 0; 0x000003C9 */


  /* Watchdog reset macro */
#ifndef __RESET_WATCHDOG
#ifdef _lint
  #define __RESET_WATCHDOG()  /* empty */
#else
  #define __RESET_WATCHDOG() (CPMUARMCOP = 0x55U, CPMUARMCOP = 0xAAU)
#endif
#endif /* __RESET_WATCHDOG */


/***********************************************/
/**   D E P R E C I A T E D   S Y M B O L S   **/
/***********************************************/
/* --------------------------------------------------------------------------- */
/* The following symbols were removed, because they were invalid or irrelevant */
/* --------------------------------------------------------------------------- */

/* **** 26/10/2012 11:18:00 AM */
#define INT_XGPRIO                       This_symb_has_been_depreciated
#define INT_XGPRIO_XILVL                 This_symb_has_been_depreciated
#define INT_XGPRIO_XILVL_MASK            This_symb_has_been_depreciated
#define INT_XGPRIO_XILVL_BITNUM          This_symb_has_been_depreciated
#define INT_CFDATA0_RQST                 This_symb_has_been_depreciated
#define INT_CFDATA1_RQST                 This_symb_has_been_depreciated
#define INT_CFDATA2_RQST                 This_symb_has_been_depreciated
#define INT_CFDATA3_RQST                 This_symb_has_been_depreciated
#define INT_CFDATA4_RQST                 This_symb_has_been_depreciated
#define INT_CFDATA5_RQST                 This_symb_has_been_depreciated
#define INT_CFDATA6_RQST                 This_symb_has_been_depreciated
#define INT_CFDATA7_RQST                 This_symb_has_been_depreciated
#define INT_CFDATA0_RQST_MASK            This_symb_has_been_depreciated
#define INT_CFDATA1_RQST_MASK            This_symb_has_been_depreciated
#define INT_CFDATA2_RQST_MASK            This_symb_has_been_depreciated
#define INT_CFDATA3_RQST_MASK            This_symb_has_been_depreciated
#define INT_CFDATA4_RQST_MASK            This_symb_has_been_depreciated
#define INT_CFDATA5_RQST_MASK            This_symb_has_been_depreciated
#define INT_CFDATA6_RQST_MASK            This_symb_has_been_depreciated
#define INT_CFDATA7_RQST_MASK            This_symb_has_been_depreciated
#define FERSTAT_DFDIF                    This_symb_has_been_depreciated
#define FERSTAT_DFDIF_MASK               This_symb_has_been_depreciated

/* **** 12/11/2012 11:34:00 AM */
#define DFPROT_DPS6                      This_symb_has_been_depreciated
#define DFPROT_DPS6_MASK                 This_symb_has_been_depreciated
#define NVDFPROT_DPS6                    This_symb_has_been_depreciated
#define NVDFPROT_DPS6_MASK               This_symb_has_been_depreciated

/* **** 10/23/2012 7:33:00 PM */
#define SCI0BDH_TNP0                                    This_symb_has_been_depreciated
#define SCI0BDH_TNP1                                    This_symb_has_been_depreciated
#define SCI0BDH_IREN                                    This_symb_has_been_depreciated
#define SCI0BDH_SBR_8                                   This_symb_has_been_depreciated
#define SCI0BDH_TNP                                     This_symb_has_been_depreciated
#define SCI0BDH_SBR                                     This_symb_has_been_depreciated
#define SCI0BDH_TNP0_MASK                               This_symb_has_been_depreciated
#define SCI0BDH_TNP1_MASK                               This_symb_has_been_depreciated
#define SCI0BDH_IREN_MASK                               This_symb_has_been_depreciated
#define SCI0BDH_SBR_8_MASK                              This_symb_has_been_depreciated
#define SCI0BDH_SBR_8_BITNUM                            This_symb_has_been_depreciated
#define SCI0BDH_TNP_MASK                                This_symb_has_been_depreciated
#define SCI0BDH_TNP_BITNUM                              This_symb_has_been_depreciated
#define SCI0BD_TNP0                                     This_symb_has_been_depreciated
#define SCI0BD_TNP1                                     This_symb_has_been_depreciated
#define SCI0BD_IREN                                     This_symb_has_been_depreciated
#define SCI0BD_SBR                                      This_symb_has_been_depreciated
#define SCI0BD_TNP                                      This_symb_has_been_depreciated
#define SCI0BD_TNP0_MASK                                This_symb_has_been_depreciated
#define SCI0BD_TNP1_MASK                                This_symb_has_been_depreciated
#define SCI0BD_IREN_MASK                                This_symb_has_been_depreciated
#define SCI0BD_SBR_MASK                                 This_symb_has_been_depreciated
#define SCI0BD_SBR_BITNUM                               This_symb_has_been_depreciated
#define SCI0BD_TNP_MASK                                 This_symb_has_been_depreciated
#define SCI0BD_TNP_BITNUM                               This_symb_has_been_depreciated
#define SCI1BDH_TNP0                                    This_symb_has_been_depreciated
#define SCI1BDH_TNP1                                    This_symb_has_been_depreciated
#define SCI1BDH_IREN                                    This_symb_has_been_depreciated
#define SCI1BDH_SBR_8                                   This_symb_has_been_depreciated
#define SCI1BDH_TNP                                     This_symb_has_been_depreciated
#define SCI1BDH_SBR                                     This_symb_has_been_depreciated
#define SCI1BDH_TNP0_MASK                               This_symb_has_been_depreciated
#define SCI1BDH_TNP1_MASK                               This_symb_has_been_depreciated
#define SCI1BDH_IREN_MASK                               This_symb_has_been_depreciated
#define SCI1BDH_SBR_8_MASK                              This_symb_has_been_depreciated
#define SCI1BDH_SBR_8_BITNUM                            This_symb_has_been_depreciated
#define SCI1BDH_TNP_MASK                                This_symb_has_been_depreciated
#define SCI1BDH_TNP_BITNUM                              This_symb_has_been_depreciated
#define SCI1BD_TNP0                                     This_symb_has_been_depreciated
#define SCI1BD_TNP1                                     This_symb_has_been_depreciated
#define SCI1BD_IREN                                     This_symb_has_been_depreciated
#define SCI1BD_SBR                                      This_symb_has_been_depreciated
#define SCI1BD_TNP                                      This_symb_has_been_depreciated
#define SCI1BD_TNP0_MASK                                This_symb_has_been_depreciated
#define SCI1BD_TNP1_MASK                                This_symb_has_been_depreciated
#define SCI1BD_IREN_MASK                                This_symb_has_been_depreciated
#define SCI1BD_SBR_MASK                                 This_symb_has_been_depreciated
#define SCI1BD_SBR_BITNUM                               This_symb_has_been_depreciated
#define SCI1BD_TNP_MASK                                 This_symb_has_been_depreciated
#define SCI1BD_TNP_BITNUM                               This_symb_has_been_depreciated
#define SSG0AMPB_AT                                     SSG0AMPB_AMPB
#define SSG0AMPB_AT_MASK                                SSG0AMPB_AMPB_MASK
#define SSG0AMPB_AT_BITNUM                              SSG0AMPB_AMPB_BITNUM
/*lint -restore  +esym(960,18.4) +esym(961,19.7) Enable MISRA rule (1.1,18.4,6.4,19.7) checking. */
#endif
